## PANDAS TUTORIAL

In [1]:
import numpy as np
import pandas as pd

### Series
* A Pandas Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.)

In [4]:
series1=pd.Series(list('abcde'))
series1

0    a
1    b
2    c
3    d
4    e
dtype: object

In [6]:
# series from array
names=np.array(['adam','derek','amy','rosa'])
names_series=pd.Series(names)
names_series

0     adam
1    derek
2      amy
3     rosa
dtype: object

In [9]:
# series from dictionary
dictionary = {'A': 10, 'B': 20, 'C': 30}
dict_series = pd.Series(dictionary)
print(dict_series)

A    10
B    20
C    30
dtype: int64

In [8]:
# scalar series
scalar_series=pd.Series(5,index=['a','b','c','d'])
scalar_series

a    5
b    5
c    5
d    5
dtype: int64

### accessing elements in a series

In [10]:
# using index
dict_series[0]

C:\Users\Vasudharajesh.i\AppData\Local\Temp\ipykernel_22400\1938179801.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dict_series[0]

10

In [12]:
dict_series[0:3]

A    10
B    20
C    30
dtype: int64

In [14]:
dict_series[1:2]

B    20
dtype: int64

In [15]:
# using name 
dict_series.loc['A']

10

In [16]:
# using position
dict_series.iloc[0]

10

### vectorized operations in series
* Vectorization in Python is a programming technique that allows you to perform operations on entire arrays at once, instead of having to loop through each element of the array individually

In [25]:
vector_series1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
vector_series2 = pd.Series([10,20,30,40,50],index=['a','b','c','d','e'])
print(vector_series1,"\n",vector_series2)

a    1
b    2
c    3
d    4
e    5
dtype: int64
 a    10
b    20
c    30
d    40
e    50
dtype: int64

In [27]:
# index value has to be same for addition
vector_series1 + vector_series2

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [29]:
vector_series3=pd.Series([1,2,3,4,5],index=['s','b','f','d','g'])
vector_series1 + vector_series3

a    NaN
b    4.0
c    NaN
d    8.0
e    NaN
f    NaN
g    NaN
s    NaN
dtype: float64

## Dataframes
* A DataFrame is a two-dimensional data structure in Python that is used to store and manipulate data.

In [30]:
# creating dataframe from list
lst = [['tom', 25], ['krish', 30],
       ['nick', 26], ['juli', 22]] 
df = pd.DataFrame(lst, columns =['Name', 'Age'])
print(df)

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [51]:
# creating dataframe from dictionary with lists
olympic_data= {'Hostcity':['London','Beijing','Athens','Sydney','Atlanta'], 'Year':[2021,2008,2004,2000,1996],
                    'No of participating countries':[205,204,201,200,197]}
df_olympic_data = pd.DataFrame(olympic_data,index=[1,2,3,4,5])
df_olympic_data

  Hostcity  Year  No of participating countries
1   London  2021                            205
2  Beijing  2008                            204
3   Athens  2004                            201
4   Sydney  2000                            200
5  Atlanta  1996                            197

In [33]:
olympic_data_dict = {'London':{2021:205},'Beijing':{2008:204}}
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)
df_olympic_data_dict

      London  Beijing
2021   205.0      NaN
2008     NaN    204.0

In [42]:
# creating dataframe from dict of series
olympic_series_participation = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],
                                  index=[2012,2008,2004,2000,1996])
df_olympic_series = pd.DataFrame({'No of participating Countries':olympic_series_participation,'Host Countries':olympic_series_country})
df_olympic_series

      No of participating Countries Host Countries
2012                            205         London
2008                            204        Beijing
2004                            201         Athens
2000                            200         Sydney
1996                            197        Atlanta

In [43]:
# creating dataframe from ndarray
array=np.array([210,2008,2004,2000,1996])
dict={'year':array}
df=pd.DataFrame(dict)
df

   year
0   210
1  2008
2  2004
3  2000
4  1996

### viewing the dataframe

In [52]:
df_olympic_data

  Hostcity  Year  No of participating countries
1   London  2021                            205
2  Beijing  2008                            204
3   Athens  2004                            201
4   Sydney  2000                            200
5  Atlanta  1996                            197

In [53]:
df_olympic_data.Hostcity

1     London
2    Beijing
3     Athens
4     Sydney
5    Atlanta
Name: Hostcity, dtype: object

In [54]:
# shows statistical summary of columns with numeric values
df_olympic_data.describe()

              Year  No of participating countries
count     5.000000                       5.000000
mean   2005.800000                     201.400000
std       9.602083                       3.209361
min    1996.000000                     197.000000
25%    2000.000000                     200.000000
50%    2004.000000                     201.000000
75%    2008.000000                     204.000000
max    2021.000000                     205.000000

In [55]:
# viewing first 2 rows
df_olympic_data.head(2)

  Hostcity  Year  No of participating countries
1   London  2021                            205
2  Beijing  2008                            204

In [56]:
# viewing last 3 rows
df_olympic_data.tail(3)

  Hostcity  Year  No of participating countries
3   Athens  2004                            201
4   Sydney  2000                            200
5  Atlanta  1996                            197

In [57]:
# view index of dataset
df_olympic_data.index

Index([1, 2, 3, 4, 5], dtype='int64')

In [59]:
# view columns of dataset
df_olympic_data.columns

Index(['Hostcity', 'Year', 'No of participating countries'], dtype='object')

### selecting data

In [62]:
# select data for host city
df_olympic_data['Hostcity']

1     London
2    Beijing
3     Athens
4     Sydney
5    Atlanta
Name: Hostcity, dtype: object

In [65]:
# select by label
df_olympic_data.loc[2] # 2 is the index

Hostcity                         Beijing
Year                                2008
No of participating countries        204
Name: 2, dtype: object

In [72]:
# select by positon
df_olympic_data.iloc[0:2] # first 2 rows

  Hostcity  Year  No of participating countries
1   London  2021                            205
2  Beijing  2008                            204

In [69]:
# selection based on index value 3- row 1- column
df_olympic_data.iat[3,1]

2000

In [71]:
# select data element by condition
df_olympic_data[df_olympic_data['No of participating countries'] == 200]

  Hostcity  Year  No of participating countries
4   Sydney  2000                            200

### Handling missing values

In [74]:
series1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
series2 = pd.Series([10,20,30,40,50],index=['c','e','f','g','h'])
series3 = series1 + series2

In [75]:
series3

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [78]:
# drop NaN values from dataset
dropna_s=series3.dropna()
dropna_s

c    13.0
e    25.0
dtype: float64

In [80]:
# replacing NaN values with 0 
fillna_s=series3.fillna(0)
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [83]:
# fill NaN with 0 before addition
fillna_before= series1.add(series2, fill_value=0)
fillna_before

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

### data operations

In [84]:
# declare movie rating dataframe: ratings from 1 to 5 (star * rating)
df_movie_rating = pd.DataFrame({'movie 1':[5,4,3,3,2,1],'movie 2':[4,5,2,3,4,2]},index=['Tom','Jeffer','Peter','Ram','Ted','Paul'])
df_movie_rating

        movie 1  movie 2
Tom           5        4
Jeffer        4        5
Peter         3        2
Ram           3        3
Ted           2        4
Paul          1        2

In [86]:

def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    if rating==2:
        return 'D'
    if rating==1:
        return 'E'
    else:
        return 'F'

movie_grade(5)

'A'

In [88]:
df_movie_rating.map(movie_grade)

       movie 1 movie 2
Tom          A       B
Jeffer       B       A
Peter        C       D
Ram          C       C
Ted          D       B
Paul         E       D

### data operations with statistical function

In [89]:
df_test_scores = pd.DataFrame({'Test1':[95,84,73,88,82,61], 'Test2':[74,85,82,73,77,79]}, index=['Jack','Lewis','Patrick','Rich','Kelly','Paula'])
df_test_scores

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     77
Paula       61     79

In [90]:
# find maximum score
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [93]:
# getting inded of max
df_test_scores.idxmax()

Test1     Jack
Test2    Lewis
dtype: object

In [94]:
# finding mean
df_test_scores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [99]:
# finding standard deviation
df_test_scores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

### group by function

In [100]:
df_president_names = pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],'last':['Bush','Clinton','Regan','Carter','Washington']})
df_president_names

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [102]:
# grouping on thr basis of first name
first_only = df_president_names.groupby('first')

In [103]:
# getting the entries in one group
first_only.get_group('George')

    first        last
0  George        Bush
4  George  Washington

In [104]:
# sorting 
df_president_names.sort_values('last')

    first        last
0  George        Bush
3   Jimmy      Carter
1    Bill     Clinton
2  Ronald       Regan
4  George  Washington

### standardizing the dataset

In [106]:
df_test_scores

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     77
Paula       61     79

In [117]:
def standardize_tests(test): 
    return (test-test.mean())/test.std()

standardize_tests(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

### Pandas data operations

In [119]:
df_student_math = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],'ID':[10,56,31,85,9,22]})
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'],'ID':[10,12,22]})

In [122]:
# merge both data to form single dataframe with math & science data
# common rows 
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1   David  22

In [121]:
# merge with key on student
pd.merge(df_student_math,df_student_science, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [123]:
# merge with key as id and left join
pd.merge(df_student_math,df_student_science, on='ID',how='left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [125]:
# concat data of both subjects
pd.concat([df_student_math, df_student_science],ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [126]:
# new dataframe
df_student=pd.DataFrame({'student':['tom','ram','harry','nick','tom','ram'],'ID':[23,45,67,10,23,45]})
df_student

  student  ID
0     tom  23
1     ram  45
2   harry  67
3    nick  10
4     tom  23
5     ram  45

In [128]:
# to check for duplicates
df_student.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [130]:
# dropping duplicates
df_student.drop_duplicates()

  student  ID
0     tom  23
1     ram  45
2   harry  67
3    nick  10

In [132]:
# dropping duplicates with student as key
df_student.drop_duplicates('student')

  student  ID
0     tom  23
1     ram  45
2   harry  67
3    nick  10

### Pandas SQL operations

In [133]:
import sqlite3

In [136]:
# create table
create_table = """CREATE TABLE student_score(Id INTEGER, Name VARCHAR(20),Math REAL,Science REAL);"""

In [137]:
# Execute SQL statement
execute_SQL = sqlite3.connect(':memory:')
execute_SQL.execute(create_table)
execute_SQL.commit()

In [138]:
#prepare SQL query
SQL_query = execute_SQL.execute('select * from student_score')

In [139]:
# fetch result from sqlite database
resultset = SQL_query.fetchall()
resultset #expty

[]

In [140]:
# records to be inserted in table
insert= [(10,'Jack',85,92),(29,'Tom',73,89),(65,'Ram',65.5,77),(5,'Steve',55,91)]

In [158]:
# inserting in SQL table , ? is a placeholder for columns
insert_statement = "Insert into student_score values (?,?,?,?)"
execute_SQL.executemany(insert_statement, insert)

In [150]:
# prepare query
SQL_query = execute_SQL.execute("select * from student_score")
# Fetch resultant for the query
resultset = SQL_query.fetchall()
resultset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [146]:
# Put records into a dataframe
df_student_records = pd.DataFrame(resultset, columns=[ 'ID','Name','Math','Science'])
df_student_records

   ID   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0

In [202]:
# another example
ct= """CREATE TABLE student_v(Id INTENGER, Name );"""

In [203]:
ex=sqlite3.connect(':memory:')
ex.execute(ct)
ex.commit()

In [204]:
q=ex.execute('select * from student_v')
result=q.fetchall()
result

[]

In [205]:
ins=[(1,'a'),(2,'b')]
ins_s="Insert into student_v values (?,?)"
ex.executemany(ins_s,ins)

In [206]:
q1=ex.execute("SELECT * FROM student_v")

In [207]:
re=q1.fetchall()
re

[(1, 'a'), (2, 'b')]

In [197]:
df=pd.DataFrame(re, columns=['id','name'])

In [199]:
df

   id name
0   1    a
1   2    b